<script setup lang="ts">
import { ref } from 'vue'

function onPrimeZoneClick() {
  document.getElementById('prime-zone')?.classList?.remove('hidden')
  document.getElementById('dms')?.classList?.add('hidden')
  clicked.value = 'prime-zone'
}

function onDmsClick() {
  document.getElementById('prime-zone')?.classList?.add('hidden')
  document.getElementById('dms')?.classList?.remove('hidden')
  clicked.value = 'dms'
}

function onDownloadButtonClick(end: string) {
  const fileUrl = `img/privilege/${end}`
  const link = document.createElement('a')
  link.href = fileUrl
  link.download = end
  document.body.appendChild(link)
  link.click()
  document.body.removeChild(link)
}

const clicked = ref('prime-zone')
</script>

<template>
  <div class="privilege-block">
    <div class="privilege-header">
      <button @click="onPrimeZoneClick">
        <img src="/img/prime-zone-logo.png" alt="" />
        <div class="gradient-line" v-show="clicked == 'prime-zone'"></div>
      </button>
      <button @click="onDmsClick">
        <h3>ДМС</h3>
        <div class="gradient-line" v-show="clicked == 'dms'"></div>
      </button>
    </div>
    <div class="privilege-footer">
      <div class="info hidden" id="dms">
        <p>
          Все сотрудники SkyAlliance, по прошествии испытательного срока, получают доступ к
          корпоративной программе добровольного медицинского страхования.
        </p>
        <img src="/img/privilege/main.jpg" alt="" />
        <img src="/img/privilege/block_1.png" alt="" />
        <br />
        <p>
          Чтобы Ваш медицинский полис всегда был под рукой, а обращение в нашу компанию стало еще
          удобнее, Вы можете загрузить мобильное приложение «АльфаСтрахование Мобайл» в AppleStore
          или GooglePlay, а также с мобильных устройств по ссылке
          <a href="https://www.alfastrah.ru/mp/">www.alfastrah.ru/mp</a>
        </p>
        <p>Полис ДМС отображается в мобильном приложении с момента начала действия полиса</p>

        <br />
        <button @click="onDownloadButtonClick('clinics.xlsx')">Клиники по программе</button>
        <br />
      </div>
      <div class="info" id="prime-zone">
        <p>
          Все сотрудники SkyAlliance получают доступ к программе корпоративных привилегий,
          специально разработанной в сотрудничестве с партнером PrimeZone.
        </p>
        <p>
          «PrimeZone» является эксклюзивным провайдером корпоративной программы привилегий от лучших
          поставщиков услуг и товаров для сотрудников крупнейших прогрессивных компаний.
        </p>
        <p>
          В рамках этой инновационной программы, сотрудники получают постоянные уникальные скидки и
          привилегии, на различные услуги и товары от 6000 лучших партнеров в России, Азербайджане и
          Казахстане, а также могут пользоваться услугой консьерж-службы, встроенной в программу -
          организовать ужин в ресторане, забронировать номер в загородном отеле, получить содействие
          и рекомендации по любым другим товарам и услугам, представленным в программе, можно
          онлайн, по телефонам и в чате мобильного приложения в режиме 24/7 .
        </p>
        <br />
        <button @click="onDownloadButtonClick('prime-zone.pdf')">PrimeZone</button>

        <div class="faq">
          <h3>FAQ</h3>
          <br />
          <div class="one-faq">
            <h5>• Как получить доступ к программе?</h5>
            <p>
              ШАГ 1: Наведите камеру на QR, нанесенный на карту, отправьте автоматически заполненное
              сообщение на почту консьерж-сервиса, с просьбой зарегистрировать Вас в программе
              привилегий PrimeZone.
            </p>
            <p>
              ШАГ 2: Найдите в Вашей корпоративной электронной почте письмо для регистрации в
              программе (письма поступают от адресов welcome@club.primezone.ru, info@primezone.ru)
            </p>
            <p>ШАГ 3: Нажмите на кнопку «Завершить Регистрацию»</p>
            <p>ШАГ 4: Придумайте пароль</p>
            <br />
            <p>
              Если вы не получили письмо, отправьте запрос на support@primezone.ru с просьбой
              выслать письмо повторно.
            </p>
          </div>
          <br />
          <div class="one-faq">
            <h5>• Какие логин и пароль использовать для входа в программу?</h5>
            <p>
              Логином будет являться ваш адрес корпоративной электронной почты, на которую придет
              письмо для завершения регистрации. Пароль вы придумываете сами, при завершении
              регистрации, пройдя по ссылке из письма.
            </p>
            <p>
              Если вы забыли пароль, воспользуйтесь функцией восстановления пароля – в форме ввода
              логина и пароля нажмите на кнопку «Забыли пароль?». Введите адрес вашей электронной
              почты, на которую придет ссылка для восстановления пароля.
            </p>
            <p>Или напишите на support@primezone.ru.</p>
          </div>
          <br />
          <div class="one-faq">
            <h5>• Могут ли пользоваться программой мои близкие родственники?</h5>
            <p>
              Да, родственники (только родители, супруги, дети) также могут получать услуги и товары
              у партнеров программы. Для этого, во время бронирования услуги через консьерж-службу,
              укажите что получателем услуги будет ваш близкий родственник.
            </p>
            <p>Передача условий, ваучеров, промокодов третьим лицам – строго запрещена.</p>
          </div>
          <br />
          <div class="one-faq">
            <h5>• Сколько раз я могу воспользоваться услугами по одному ваучеру?</h5>
            <p>1 услуга – 1 ваучер.</p>
          </div>
          <br />
          <div class="one-faq">
            <h5>• Сколько раз я могу воспользоваться какой-либо услугой?</h5>
            <p>
              Количество обращений неограниченно (перед заказом услуги ознакомьтесь с правилами ее
              предоставления на сайте).
            </p>
          </div>
          <br />
          <div class="one-faq">
            <h5>
              • Могу ли я, проживая в одном городе России, пользоваться услугами партнеров
              PrimeZone, представленными в других городах?
            </h5>
            <p>
              Да. Для этого необходимо выбрать интересующий город в соответствующем меню на сайте и
              локальные предложения в выбранном городе также доступны для использования.
            </p>
          </div>
          <br />
          <div class="one-faq">
            <h5>• Если у меня есть вопросы по конкретной услуге, куда мне обратиться?</h5>
            <p>
              Вы можете обратиться в консьерж-службу по телефонам +7 (499) 348-15-70, 8 (800)
              100-39-83, написать на support@primezone.ru или написать в чат в мобильном приложении
              (режим работы 24/7).
            </p>
          </div>
          <br />
          <div class="one-faq">
            <h5>• Есть ли мобильное приложение?</h5>
            <p>Да, вы можете скачать приложение «PrimeZone» в AppStore и GooglePlay.</p>
            <p>
              Для первичной авторизации в приложении (ввод пин-кода) войдите в свою учетную запись
              на сайте программы club.primezone.ru, а затем нажмите на кнопку «Мобильное приложение»
              в верхнем меню сайта и с открывшейся страницы введите индивидуальный пин-код в
              приложение.
            </p>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
