<script setup lang="ts">
import { useRoute } from 'vue-router'
import router from '@/router'

import OneLittleBlog from '@/components/blogs/OneLittleBlog.vue'

const route = useRoute()

function onOtherBlogsClick() {
  const login = route.params.login
  router.push({ name: 'all-blogs', params: { login: login } })
}
</script>

<template>
  <div class="one-blog-block">
    <div class="about-author">
      <img src="" alt="" />
      <div class="time-and-name">
        <p>21.09.2023 14:33</p>
        <h4>Смирнов Анатолий</h4>
      </div>
    </div>

    <div class="text">
      <h1>Маркетинг в 2023 году. Трансформация в эпоху цифровой реальности</h1>
      <p>
        В 2023 году маркетинг становится неотъемлемой частью цифровой реальности, которая продолжает
        преображать способы, которыми компании привлекают, вовлекают и удерживают своих клиентов.
        Одной из ключевых тенденций становится увеличение внимания к глубокому пониманию и
        удовлетворению потребностей клиентов через персонализированный подход. Технологии машинного
        обучения и анализа больших данных позволяют компаниям создавать более точные профили своих
        потребителей и адаптировать маркетинговые кампании под их индивидуальные предпочтения и
        потребности. Контент-маркетинг остается на пике популярности. Однако, в 2023 году компании
        сталкиваются с необходимостью создания более оригинального, интересного и ценного контента
        для удержания внимания аудитории в условиях информационного перенасыщения.
      </p>
    </div>

    <div class="other-blogs">
      <h3 @click="onOtherBlogsClick()">Читать другие статьи</h3>
      <div class="two-blogs">
        <OneLittleBlog
          date="21.09.2023 14:33"
          author="Смирнов Анатолий"
          title="Маркетинг в 2023 году. Трансформация в эпоху цифровой реальности"
          text="В 2023 году маркетинг становится неотъемлемой частью цифровой реальности, которая
            продолжает преображать способы, которыми компании привлекают, вовлекают и удерживают
            своих клиентов."
        />
        <OneLittleBlog
          date="21.09.2023 14:33"
          author="Смирнов Анатолий"
          title="Маркетинг в 2023 году. Трансформация в эпоху цифровой реальности"
          text="В 2023 году маркетинг становится неотъемлемой частью цифровой реальности, которая
            продолжает преображать способы, которыми компании привлекают, вовлекают и удерживают
            своих клиентов."
        />
      </div>
    </div>
  </div>
</template>
